---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFoundationsMark
source: html/0057ee73-8657-e2dd-3783-9d35380cd279.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFoundationsMark Property

"Foundation Number": Used for isolated, wall foundations

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelFoundationsMark { get; }
```